src/cfe/archic41c_БСП.ТочкиИнтеграции/src/Catalogs/ИнформационныеСистемы/ИнформационныеСистемы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеСистемы</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>DefinedType.Пользователь</types>
    </type>
  </attributes>
  <attributes>
    <name>АрхитектураРаботы</name>
    <type>
      <types>EnumRef.АрхитектурыРаботыИС</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ресурсы</name>
    <attributes>
      <name>РесурсИнформационнойСистемы</name>
      <type>
        <types>CatalogRef.РесурсыИнформационныхСистем</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cfe/archic41c_БСП.ТочкиИнтеграции/src/Catalogs/ИнформационныеСистемы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает массив ресурсов информационной системы
//
// Параметры:
//  ИнформационнаяСистема	 - СправочникСсылка.ИнформационныеСистемы - инф.система 
// 
// Возвращаемое значение:
//  Массив Из СправочникСсылка.ИнформационныеСистемы 
//
Функция СписокРесурсовИнформационнойСистемы(ИнформационнаяСистема) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИнформационныеСистемыРесурсы.РесурсИнформационнойСистемы КАК РесурсИнформационнойСистемы
	               |ИЗ
	               |	Справочник.ИнформационныеСистемы.Ресурсы КАК ИнформационныеСистемыРесурсы
	               |ГДЕ
	               |	ИнформационныеСистемыРесурсы.Ссылка = &Ссылка
	               |	И НЕ ИнформационныеСистемыРесурсы.РесурсИнформационнойСистемы.ПометкаУдаления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ИнформационныеСистемыРесурсы.НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", ИнформационнаяСистема);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выгрузить();
	
	МассивДанных = Выборка.ВыгрузитьКолонку("РесурсИнформационнойСистемы");
	
	Возврат МассивДанных;

КонецФункции


#КонецОбласти

#КонецЕсли
